/*------------------------------------------------------------------*-
  
   SCH51.H (v1.00)

  ------------------------------------------------------------------

   - 详见SCH51.C

-*------------------------------------------------------------------*/

#ifndef _SCH51_H
#define _SCH51_H

// ------ 公共数据类型声明 ----------------------------

//存储在数据区，如果可能，快速访问
//每个任务的总内存为7字节
typedef data struct 
   {
   void (code * pTask)(void);  //指向任务的指针(必须是一个'void (void)'函数)
   
   tWord Delay;    //延迟(ticks)直到函数将被(下一个)运行   
									 // -详见SCH_Add_Task()
 
   tWord Period;   //每次运行的间隔。 -详见SCH_Add_Task()

   tByte RunMe;    //当任务即将执行时递增(由调度程序)   
   } sTask; 

// ------ 公共函数原型 -------------------------------

/* 内核调度程序功能 */
void  SCH_Dispatch_Tasks(void);
tByte SCH_Add_Task(void (code*) (void), const tWord, const tWord);  
bit   SCH_Delete_Task(const tByte);
void SCH_Init_T0(void);
void SCH_Start(void);
void SCH_Update(void);

// ------ 公共常量 -----------------------------------------

//每次需要的最大任务数
//在程序执行期间
//
// 必须为每个新项目调整
#define SCH_MAX_TASKS   (2)   
 
#endif
                              
/*------------------------------------------------------------------*-
  ---- END OF FILE -------------------------------------------------
-*------------------------------------------------------------------*/

